#include<stdio.h>

void main()
{
	int i=8;
	printf("%d\n",++i);
	printf("%d\n",--i);
    printf("%d\n",i++);
    printf("%d\n",i--);
	printf("%d\n",-i++);
	printf("%d\n",-i--);//9,8,8,9,-8,-9//

	int k=5,l=5,p,q;
	p=(k++)+(k++)+(k++);
	q=(++l)+(++l)+(++l);
	printf("%d,%d,%d,%d\n",k,l,p,q); //8,8,15,24//

	int a,b=322;
	float x,y=8.88;
	char c1='k',c2;
	a=y;
	x=b;
	a=c1;
	c2=b;
	printf("%d,%f,%d,%c",a,x,a,c2); //107,322.000000,107,B//

}
//        () [] ->.         自左向右//
//! ~ ++ -- + - * & sizeof  自右向左//
//         * / %            自左向右//
//          + -             自左向右//
//         << >>            自左向右//
//        < <=> >=          自左向右//
//         == !=            自左向右//
//           &              自左向右//
//           ^              自左向右//
//           |              自左向右//
//          &&              自左向右//
//           ||             自左向右//
//           ?:             自右向左//
//= += -= *= /= %= &= `= |= <<= >>= 自右向左//
//(最低)      ,             自左向右//